{
  "title": "The Journey",
  "thumbnail": "/img/1200x900.png",
  "body": "**The Journey**\n\nKatie Erpel -  Rider, Trainer, Competitor, and Instructor, brings a lifetime’s worth of knowledge and Horsemanship to her training and instruction. Having grown up out of a Training-Boarding Facility, with a mother that's also a trainer, Katie has been riding since in utero. Horses have always been a way of life, and riding comes second nature to her. Growing up at training facility, Katie's mother, always made sure to put her every type of horse that came in for training; whether it be a reining horse, Dressage Horse, OTTB, or a bucking, problem horse. This developed Katie's innate sense of feel to be able to properly assess any horse she may encounter to this day, along with taking pride in being able to help bring out the best in each individual horse, to create harmony and lightness no matter the natural talent, breed, discipline, or level of training.\n\nAt the the young age of 9, Katie’s Dressage career started on a Quarter Horse. She, then, graduated to a PRE gelding at 10 years old, began apprenticing with FEI trainers, and started competing at USDF Shows. Throughout her teenage years, she trained and competed in USDF Young Riders, taking USDF Reserve Champion First Level as a 12 year old. At 14, she went to Germany to further her Classical Dressage Theory knowledge, and rode at the Etoile Riding School.\n\nSince horse training was all Katie had ever done and knew throughout her entire life, she decided to attend college, in order to be well-rounded and educated. Katie graduated from Georgia State University with two Bachelor's Degrees in German and Spanish with a concentration in International Business. During college, she returned to study and ride in Germany. She also worked as Trainer’s Assistant at After the Fox Farm for FEI Trainers - Roel Theunissen, Adam Lastowka, and Sandy Osborn.\n\nAfter a few years of working a “normal job”, Katie came to the realization that that her life’s passion lies in Dressage. Evolving as the best possible rider, instructor, and horsewoman is what drives her.  Since this epiphany and  returning to her roots, she has committed her life and career to pursuing her goals of becoming a Renowned FEI Competitor, Trainer, and Instructor. Currently, she is also participating in the USDF L-Program, in pursuits of her USDF Judging License.\n\nKatie firmly believes that in order to be an outstanding teacher and trainer, one must must first and foremost continue to be a lifelong student themselves. Therefore, she is dedicated to studying and investing in her own education, as well. \n\nThrough the years, Katie has been consistently in training and riding in clinics with many very exciting FEI Grand Prix Trainers such as:\n\n* Adam Lastowka\n* Roel Theunissen \n* Lisa Wilcox\n* Liz Austin\n* Sandy Osborn\n* Lyndon Rife\n* Stacy Hastings\n* Katie Poag\n* Shawna Harding\n* Natalie Lamping\n* Alison Head\n* Jermey Steinberg\n\nIn 2018, Katie apprenticed with FEI Competitor and Trainer, Shawna Harding, and learned a great deal from her.\n\nStarting out the new decade of 2020, Katie has big dreams for her up-and-coming young KWPN, Levander, and has been consistently continuing her education in Aiken, SC, working closely with Former USEF, Youth Coach - Jeremy Steinberg, along with riding in clinics with acclaimed FEI Trainers and Judges.\n\n\\*\\* Katie is always open to opportunities to develop and campaign talented horses or to work with breeders to develop young horses. Please, contact her for any inquiries.",
  "albumRel": "Nested Fields Gallery duplicate"
}