{
  "title": "Gallery",
  "icon": "photos",
  "body": "Coming from an equestrian family, Katie brings generations worth of horsemanship and horse sense to her training. With a non-confrontational approach, Katie uses the Classical Dressage Principals to help gymnasticize the horse by teaching him/her the foundational tools required, that are needed to be more responsive to the aids, steady, and harmonious.\n\nFor over 2 decades, Katie has trained with top FEI trainers, and has developed a methodical system using classical dressage principles and exercises to create a more harmonious partnership between horse and rider. Katie’s goal is to clearly convey this system, so that horses and riders that have a mutual respect and understanding of one another\n\n> Skill comes from consistent and deliberate practice\n\n**Services:**\n\n* Starting of Young Horses using Classical Principles and Ground-Work Preparation\n* Young Horse Ground Manner Training\n* Correct Back-to-Front Training from Green Horses to FEI\n* Lessons/Rides at Your Farm or Mine\n\n  * Trailer-In Lessons at My Farm in Williston, SC - 100x200 Regulation Sand Arena\n  * Trailer-In to Covered/Mirrored Dressage Arena for Lesson - Additional Fee of $35\n* Longe Lessons - Improving Rider Position - On My School-Master or Your Horse\n* Corrective Training for Problem/Horses with “Vices”\n* Classical Corrective Training Groundwork\n* Trailer-Loading Training\n* Clinics\n\n\\*\\** Katie has also worked extensively with Stallions, Warmbloods, and Spanish Breeds (PRE, Andalusians, and Lusitanos). (At times, the Spanish breeds are misunderstood, and take a different training approach than your traditional breeds.)\n\n**Lesson Program:**\n\n*It's important to Katie to focus first and foremost on the rider's position, confidence, and thus, effectiveness. After the foundations of correct rider position are established the horse will follow suit. Training is done methodically following the Classical Dressage Training Scale.*\n\n*  **Students and Lesson Packages**\n\n  * Beginners-Advanced/All Disciplines/Breeds Welcome\n  * Strong Focus on Correct Rider Position\n  * $55 Lesson/Ride (3 or more a week at $50 a lesson/ride)\n  * One Month of Training - 5x a week ( $40 a ride/lesson)\n  * School Master Longe Lessons - $85\n  * Travel Fees -\n\n    * 20 miles + - $10\n    * 30 miles + - $15\n    * 40 Miles + - $20 - 2 or more lessons\n    * 60 Miles + - $30 - 2 or more lessons\n* **Training Board**\n\n  * Full Training 5x/week (20x/month) $800\n  * Boarding from approved facilities in the Aiken County/Augusta Area - available boarding based on your budget/preferences - from $400 to $1000 a month\n* **School Master Lessons**\n\n  * On my 4th Level Andalusian School Master\n  * Longe Lessons - feel a true half-halt, and work on your rider position\n* **Rehab**\n\n  * If your horse is recovering from an injury - correct balance, and knowing how far to push is crucial\n* **Show Preparation**\n\n  * With over a decade's worth of USDF competition experience from Training Level to Fourth Level on an array of breeds, Katie can help campaign your horse or help you and your horse achieve your competition goals.",
  "albumRel": "Nested Fields Gallery"
}