{
  "icon": "",
  "title": "Equine Partners ",
  "body": "![](/img/katie-erpel-9596.jpg)\n\n**Levander** - 2016 KWPN by Special D (Bred by Breezy Hill South, Aiken, SC)\n\nLevander is a special soul, and is the full package. He has beauty, talent, a natural ability for Dressage, and also has the most wonderful disposition. He was purchased as a two year for Katie to be able to have a horse that is a \"clean slate\", and to have the entire journey with - to train, learn together, and bring up the levels, with aspirations to FEI and beyond.\n\nKatie has put all the foundational groundwork, in-hand training, and riding on Levander. Since starting Levander, she has also worked closely with Jeremy Steinberg ensuring that Levander has a solid, Classical Dressage Foundation with Grand Prix in mind. \n\nLevander is a demonstration of Katie's methodical system and abilities to give young horses a correct foundation right from the start to mold them not only physically, but psychologically, as well.  \n\n\n\n![](/img/85181952_789719214843820_9185985360155377664_n.jpg)\n\n(Erik - add page break ) \n\n![](/img/84855764_793193854496356_3736579418185793536_n.jpg)\n\n**Fjorde do Castanheiro (Fernando)** \n\n2009 - Lusitano by Zurquis Comando SN - Haras do Castanheiro,  Sau Paulo, Brazil \n\nFernando came to Katie in September of 2019 as a 'project horse', and is a completely different ride from Levander in every sense. He is hot, sensitive, majestic, and came with history of being \"confrontational,\" to say the least. \n\nWith methodical, consistent, patient training, focusing on the basics of Dressage, Fernando has developed into quite a reliable partner. Katie has begun desensitizing him with a varied program of hacking out, cavaletties, and taking him off property. After 3 months of training, she took him to his first ever show, as well as USDF Show, and scored a 68% at Second Level Test 3, earning a score towards USDF Regionals. \n\nHorses become fried and \"confrontational\" when they are pushed before they are ready. Therefore, it is especially important when working with horses that need 're-training' to work on the psychological aspects, as well as making sure to train the horse in the proper basics. Then one can find, which steps were skipped. Katie is going to spend, whatever the  required amount of time may be,  focusing on strength, conditioning, and re-installing a strong foundation, and work ethic into Fernando. \n\nFernando has a lovely disposition, and with someone, like Katie, who is willing to invest the time, he is truly developing into a special partner. Katie, also, has big dreams and aspirations for this horse. \n\n![](/img/80675237_10215921435245004_3682402636289540096_o.jpg)",
  "albumRel": "Nested Fields Gallery duplicate"
}